In [1]:
import pandas as pd
import numpy as np
from datetime import time
df = pd.read_excel('CHURNDATA (1).xlsx')

In [2]:
df.head()

,CUS_DOB,AGE,CUS_Month_Income,CUS_Gender,CUS_Marital_Status,CUS_Customer_Since,YEARS_WITH_US,Total debit transactions for S1,Total debit transactions for S2,Total debit transactions for S3,...,Total credit amount for S2,Total credit amount for S3,Total debit amount,Total debit transactions,Total credit amount,Total credit transactions,Total transactions,CUS_Target,TAR_Desc,Status
0,Feb 13 1970 12:00AM,49,7116.64,MALE,MARRIED,1994-06-30,25,277,265,345,...,1764079.61,2378592.62,4758311.63,887,5659653.33,65,952,2231,EXECUTIVE,ACTIVE
1,Sep 20 1973 12:00AM,46,1500000.00,FEMALE,SINGLE,2005-05-19,14,37,15,45,...,19500.00,57500.00,139363.22,97,87000.00,10,107,2223,LOW,ACTIVE
2,Jul 18 1966 12:00AM,53,5000000.00,FEMALE,SINGLE,2005-05-20,14,31,14,8,...,240311.84,70946.86,37375.46,53,1020883.70,27,80,2222,MIDLE,ACTIVE
3,Jan 9 2004 12:00AM,15,500.00,FEMALE,SINGLE,2005-05-20,14,0,1,0,...,28089.99,18753.92,4000.00,1,76946.96,12,13,2223,LOW,ACTIVE
4,Mar 7 1971 12:00AM,48,9000000.00,FEMALE,SINGLE,2014-06-30,5,15,33,12,...,176000.00,70500.00,338470.29,60,442100.00,21,81,2223,LOW,ACTIVE

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1249 entries, 0 to 1248
Data columns (total 27 columns):
 #   Column                            Non-Null Count  Dtype
---  ------                            --------------  -----
 0   CUS_DOB                           1249 non-null   object
 1   AGE                               1249 non-null   int64
 2   CUS_Month_Income                  1238 non-null   float64
 3   CUS_Gender                        1247 non-null   object
 4   CUS_Marital_Status                1249 non-null   object
 5   CUS_Customer_Since                1249 non-null   datetime64[ns]
 6   YEARS_WITH_US                     1249 non-null   int64
 7   Total debit transactions for S1   1249 non-null   int64
 8   Total debit transactions for S2   1249 non-null   int64
 9   Total debit transactions for S3   1249 non-null   int64
 10  Total debit amount for S1         1249 non-null   float64
 11  Total debit amount for S2         1249 non-null   float64
 12  Total debit amount for S3         1249 non-null   float64
 13  Total credit transactions for S1  1249 non-null   int64
 14  Total credit transactions for S2  1249 non-null   int64
 15  Total credit transactions for S3  1249 non-null   int64
 16  Total credit amount for S1        1249 non-null   float64
 17  Total credit amount for S2        1249 non-null   float64
 18  Total credit amount for S3        1249 non-null   float64
 19  Total debit amount                1249 non-null   float64
 20  Total debit transactions          1249 non-null   int64
 21  Total credit amount               1249 non-null   float64
 22  Total credit transactions         1249 non-null   int64
 23  Total transactions                1249 non-null   int64
 24  CUS_Target                        1249 non-null   int64
 25  TAR_Desc                          1249 non-null   object
 26  Status                            1249 non-null   object
dtypes: datetime64[ns](1), float64(9), int64(12), object(5)
memory usage: 263.6+ KB

In [4]:
df['CUS_DOB'] = pd.to_datetime(df['CUS_DOB'])

In [5]:
df['DOB_YEAR'] = df['CUS_DOB'].dt.year
df['DOB_MONTH'] = df['CUS_DOB'].dt.month
df['DOB_DATE'] = df['CUS_DOB'].dt.day

In [6]:
df.head()

,CUS_DOB,AGE,CUS_Month_Income,CUS_Gender,CUS_Marital_Status,CUS_Customer_Since,YEARS_WITH_US,Total debit transactions for S1,Total debit transactions for S2,Total debit transactions for S3,...,Total debit transactions,Total credit amount,Total credit transactions,Total transactions,CUS_Target,TAR_Desc,Status,DOB_YEAR,DOB_MONTH,DOB_DATE
0,1970-02-13,49,7116.64,MALE,MARRIED,1994-06-30,25,277,265,345,...,887,5659653.33,65,952,2231,EXECUTIVE,ACTIVE,1970,2,13
1,1973-09-20,46,1500000.00,FEMALE,SINGLE,2005-05-19,14,37,15,45,...,97,87000.00,10,107,2223,LOW,ACTIVE,1973,9,20
2,1966-07-18,53,5000000.00,FEMALE,SINGLE,2005-05-20,14,31,14,8,...,53,1020883.70,27,80,2222,MIDLE,ACTIVE,1966,7,18
3,2004-01-09,15,500.00,FEMALE,SINGLE,2005-05-20,14,0,1,0,...,1,76946.96,12,13,2223,LOW,ACTIVE,2004,1,9
4,1971-03-07,48,9000000.00,FEMALE,SINGLE,2014-06-30,5,15,33,12,...,60,442100.00,21,81,2223,LOW,ACTIVE,1971,3,7

In [7]:
df.drop('CUS_DOB', axis=1,inplace=True)

In [8]:
df.head()

,AGE,CUS_Month_Income,CUS_Gender,CUS_Marital_Status,CUS_Customer_Since,YEARS_WITH_US,Total debit transactions for S1,Total debit transactions for S2,Total debit transactions for S3,Total debit amount for S1,...,Total debit transactions,Total credit amount,Total credit transactions,Total transactions,CUS_Target,TAR_Desc,Status,DOB_YEAR,DOB_MONTH,DOB_DATE
0,49,7116.64,MALE,MARRIED,1994-06-30,25,277,265,345,1459126.64,...,887,5659653.33,65,952,2231,EXECUTIVE,ACTIVE,1970,2,13
1,46,1500000.00,FEMALE,SINGLE,2005-05-19,14,37,15,45,35372.55,...,97,87000.00,10,107,2223,LOW,ACTIVE,1973,9,20
2,53,5000000.00,FEMALE,SINGLE,2005-05-20,14,31,14,8,28248.85,...,53,1020883.70,27,80,2222,MIDLE,ACTIVE,1966,7,18
3,15,500.00,FEMALE,SINGLE,2005-05-20,14,0,1,0,0.00,...,1,76946.96,12,13,2223,LOW,ACTIVE,2004,1,9
4,48,9000000.00,FEMALE,SINGLE,2014-06-30,5,15,33,12,69083.38,...,60,442100.00,21,81,2223,LOW,ACTIVE,1971,3,7

In [9]:
df['CUS_Month_Income'] = df['CUS_Month_Income'].fillna(0)

In [10]:
df['CUS_Gender'].value_counts()

MALE      741
FEMALE    506
Name: CUS_Gender, dtype: int64

In [11]:
df['CUS_Gender'].replace({'MALE':0,'FEMALE':1},inplace=True)

In [12]:
df['CUS_Gender'].unique()

array([ 0.,  1., nan])

In [13]:
# Calculate the mean value of the feature
mean_value = df['CUS_Gender'].mean()

# Replace missing values with the mean value
df['CUS_Gender'].fillna(mean_value, inplace=True)

In [14]:
df['CUS_Gender'] = df['CUS_Gender'].astype(int)

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1249 entries, 0 to 1248
Data columns (total 29 columns):
 #   Column                            Non-Null Count  Dtype
---  ------                            --------------  -----
 0   AGE                               1249 non-null   int64
 1   CUS_Month_Income                  1249 non-null   float64
 2   CUS_Gender                        1249 non-null   int32
 3   CUS_Marital_Status                1249 non-null   object
 4   CUS_Customer_Since                1249 non-null   datetime64[ns]
 5   YEARS_WITH_US                     1249 non-null   int64
 6   Total debit transactions for S1   1249 non-null   int64
 7   Total debit transactions for S2   1249 non-null   int64
 8   Total debit transactions for S3   1249 non-null   int64
 9   Total debit amount for S1         1249 non-null   float64
 10  Total debit amount for S2         1249 non-null   float64
 11  Total debit amount for S3         1249 non-null   float64
 12  Total credit transactions for S1  1249 non-null   int64
 13  Total credit transactions for S2  1249 non-null   int64
 14  Total credit transactions for S3  1249 non-null   int64
 15  Total credit amount for S1        1249 non-null   float64
 16  Total credit amount for S2        1249 non-null   float64
 17  Total credit amount for S3        1249 non-null   float64
 18  Total debit amount                1249 non-null   float64
 19  Total debit transactions          1249 non-null   int64
 20  Total credit amount               1249 non-null   float64
 21  Total credit transactions         1249 non-null   int64
 22  Total transactions                1249 non-null   int64
 23  CUS_Target                        1249 non-null   int64
 24  TAR_Desc                          1249 non-null   object
 25  Status                            1249 non-null   object
 26  DOB_YEAR                          1249 non-null   int64
 27  DOB_MONTH                         1249 non-null   int64
 28  DOB_DATE                          1249 non-null   int64
dtypes: datetime64[ns](1), float64(9), int32(1), int64(15), object(3)
memory usage: 278.2+ KB

In [16]:
df['CUS_Marital_Status'].value_counts()

SINGLE     879
MARRIED    328
DIVORCE     30
WIDOWED     10
OTHER        1
PARTNER      1
Name: CUS_Marital_Status, dtype: int64

In [17]:
df['CUS_Marital_Status'].replace({'SINGLE':0,'MARRIED':1,'DIVORCE':2,'WIDOWED':3,'OTHER':4,'PARTNER':5},inplace=True)

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1249 entries, 0 to 1248
Data columns (total 29 columns):
 #   Column                            Non-Null Count  Dtype
---  ------                            --------------  -----
 0   AGE                               1249 non-null   int64
 1   CUS_Month_Income                  1249 non-null   float64
 2   CUS_Gender                        1249 non-null   int32
 3   CUS_Marital_Status                1249 non-null   int64
 4   CUS_Customer_Since                1249 non-null   datetime64[ns]
 5   YEARS_WITH_US                     1249 non-null   int64
 6   Total debit transactions for S1   1249 non-null   int64
 7   Total debit transactions for S2   1249 non-null   int64
 8   Total debit transactions for S3   1249 non-null   int64
 9   Total debit amount for S1         1249 non-null   float64
 10  Total debit amount for S2         1249 non-null   float64
 11  Total debit amount for S3         1249 non-null   float64
 12  Total credit transactions for S1  1249 non-null   int64
 13  Total credit transactions for S2  1249 non-null   int64
 14  Total credit transactions for S3  1249 non-null   int64
 15  Total credit amount for S1        1249 non-null   float64
 16  Total credit amount for S2        1249 non-null   float64
 17  Total credit amount for S3        1249 non-null   float64
 18  Total debit amount                1249 non-null   float64
 19  Total debit transactions          1249 non-null   int64
 20  Total credit amount               1249 non-null   float64
 21  Total credit transactions         1249 non-null   int64
 22  Total transactions                1249 non-null   int64
 23  CUS_Target                        1249 non-null   int64
 24  TAR_Desc                          1249 non-null   object
 25  Status                            1249 non-null   object
 26  DOB_YEAR                          1249 non-null   int64
 27  DOB_MONTH                         1249 non-null   int64
 28  DOB_DATE                          1249 non-null   int64
dtypes: datetime64[ns](1), float64(9), int32(1), int64(16), object(2)
memory usage: 278.2+ KB

In [19]:
df['CUS_Customer_Since']

0      1994-06-30
1      2005-05-19
2      2005-05-20
3      2005-05-20
4      2014-06-30
          ...
1244   2005-07-25
1245   2005-07-27
1246   2005-07-25
1247   2005-07-26
1248   2005-07-26
Name: CUS_Customer_Since, Length: 1249, dtype: datetime64[ns]

In [20]:
df['CUS_SINCE_YEAR'] = df['CUS_Customer_Since'].dt.year
df['CUS_SINCE_MONTH'] = df['CUS_Customer_Since'].dt.month
df['CUS_SINCE_DAY'] = df['CUS_Customer_Since'].dt.day

In [21]:
df.head()

,AGE,CUS_Month_Income,CUS_Gender,CUS_Marital_Status,CUS_Customer_Since,YEARS_WITH_US,Total debit transactions for S1,Total debit transactions for S2,Total debit transactions for S3,Total debit amount for S1,...,Total transactions,CUS_Target,TAR_Desc,Status,DOB_YEAR,DOB_MONTH,DOB_DATE,CUS_SINCE_YEAR,CUS_SINCE_MONTH,CUS_SINCE_DAY
0,49,7116.64,0,1,1994-06-30,25,277,265,345,1459126.64,...,952,2231,EXECUTIVE,ACTIVE,1970,2,13,1994,6,30
1,46,1500000.00,1,0,2005-05-19,14,37,15,45,35372.55,...,107,2223,LOW,ACTIVE,1973,9,20,2005,5,19
2,53,5000000.00,1,0,2005-05-20,14,31,14,8,28248.85,...,80,2222,MIDLE,ACTIVE,1966,7,18,2005,5,20
3,15,500.00,1,0,2005-05-20,14,0,1,0,0.00,...,13,2223,LOW,ACTIVE,2004,1,9,2005,5,20
4,48,9000000.00,1,0,2014-06-30,5,15,33,12,69083.38,...,81,2223,LOW,ACTIVE,1971,3,7,2014,6,30

In [22]:
df.drop('CUS_Customer_Since',axis=1,inplace=True)

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1249 entries, 0 to 1248
Data columns (total 31 columns):
 #   Column                            Non-Null Count  Dtype
---  ------                            --------------  -----
 0   AGE                               1249 non-null   int64
 1   CUS_Month_Income                  1249 non-null   float64
 2   CUS_Gender                        1249 non-null   int32
 3   CUS_Marital_Status                1249 non-null   int64
 4   YEARS_WITH_US                     1249 non-null   int64
 5   Total debit transactions for S1   1249 non-null   int64
 6   Total debit transactions for S2   1249 non-null   int64
 7   Total debit transactions for S3   1249 non-null   int64
 8   Total debit amount for S1         1249 non-null   float64
 9   Total debit amount for S2         1249 non-null   float64
 10  Total debit amount for S3         1249 non-null   float64
 11  Total credit transactions for S1  1249 non-null   int64
 12  Total credit transactions for S2  1249 non-null   int64
 13  Total credit transactions for S3  1249 non-null   int64
 14  Total credit amount for S1        1249 non-null   float64
 15  Total credit amount for S2        1249 non-null   float64
 16  Total credit amount for S3        1249 non-null   float64
 17  Total debit amount                1249 non-null   float64
 18  Total debit transactions          1249 non-null   int64
 19  Total credit amount               1249 non-null   float64
 20  Total credit transactions         1249 non-null   int64
 21  Total transactions                1249 non-null   int64
 22  CUS_Target                        1249 non-null   int64
 23  TAR_Desc                          1249 non-null   object
 24  Status                            1249 non-null   object
 25  DOB_YEAR                          1249 non-null   int64
 26  DOB_MONTH                         1249 non-null   int64
 27  DOB_DATE                          1249 non-null   int64
 28  CUS_SINCE_YEAR                    1249 non-null   int64
 29  CUS_SINCE_MONTH                   1249 non-null   int64
 30  CUS_SINCE_DAY                     1249 non-null   int64
dtypes: float64(9), int32(1), int64(19), object(2)
memory usage: 297.7+ KB

In [24]:
df['TAR_Desc'].value_counts()

LOW          753
MIDLE        406
EXECUTIVE     59
PLATINUM      31
Name: TAR_Desc, dtype: int64

In [25]:
df['TAR_Desc'].replace({'LOW':0,'MIDLE':1,'EXECUTIVE':2,'PLATINUM':3},inplace=True)

In [26]:
df['TAR_Desc'].unique()

array([2, 0, 1, 3], dtype=int64)

In [27]:
df['Status'].value_counts()

ACTIVE    1022
CHURN      227
Name: Status, dtype: int64

In [28]:
df['Status'].replace({'ACTIVE':1,'CHURN':0},inplace=True)

In [29]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1249 entries, 0 to 1248
Data columns (total 31 columns):
 #   Column                            Non-Null Count  Dtype
---  ------                            --------------  -----
 0   AGE                               1249 non-null   int64
 1   CUS_Month_Income                  1249 non-null   float64
 2   CUS_Gender                        1249 non-null   int32
 3   CUS_Marital_Status                1249 non-null   int64
 4   YEARS_WITH_US                     1249 non-null   int64
 5   Total debit transactions for S1   1249 non-null   int64
 6   Total debit transactions for S2   1249 non-null   int64
 7   Total debit transactions for S3   1249 non-null   int64
 8   Total debit amount for S1         1249 non-null   float64
 9   Total debit amount for S2         1249 non-null   float64
 10  Total debit amount for S3         1249 non-null   float64
 11  Total credit transactions for S1  1249 non-null   int64
 12  Total credit transactions for S2  1249 non-null   int64
 13  Total credit transactions for S3  1249 non-null   int64
 14  Total credit amount for S1        1249 non-null   float64
 15  Total credit amount for S2        1249 non-null   float64
 16  Total credit amount for S3        1249 non-null   float64
 17  Total debit amount                1249 non-null   float64
 18  Total debit transactions          1249 non-null   int64
 19  Total credit amount               1249 non-null   float64
 20  Total credit transactions         1249 non-null   int64
 21  Total transactions                1249 non-null   int64
 22  CUS_Target                        1249 non-null   int64
 23  TAR_Desc                          1249 non-null   int64
 24  Status                            1249 non-null   int64
 25  DOB_YEAR                          1249 non-null   int64
 26  DOB_MONTH                         1249 non-null   int64
 27  DOB_DATE                          1249 non-null   int64
 28  CUS_SINCE_YEAR                    1249 non-null   int64
 29  CUS_SINCE_MONTH                   1249 non-null   int64
 30  CUS_SINCE_DAY                     1249 non-null   int64
dtypes: float64(9), int32(1), int64(21)
memory usage: 297.7 KB

In [30]:
X = df.drop('Status', axis=1)
y = df['Status']

In [31]:
X.head()

,AGE,CUS_Month_Income,CUS_Gender,CUS_Marital_Status,YEARS_WITH_US,Total debit transactions for S1,Total debit transactions for S2,Total debit transactions for S3,Total debit amount for S1,Total debit amount for S2,...,Total credit transactions,Total transactions,CUS_Target,TAR_Desc,DOB_YEAR,DOB_MONTH,DOB_DATE,CUS_SINCE_YEAR,CUS_SINCE_MONTH,CUS_SINCE_DAY
0,49,7116.64,0,1,25,277,265,345,1459126.64,1230543.08,...,65,952,2231,2,1970,2,13,1994,6,30
1,46,1500000.00,1,0,14,37,15,45,35372.55,20134.00,...,10,107,2223,0,1973,9,20,2005,5,19
2,53,5000000.00,1,0,14,31,14,8,28248.85,4777.66,...,27,80,2222,1,1966,7,18,2005,5,20
3,15,500.00,1,0,14,0,1,0,0.00,4000.00,...,12,13,2223,0,2004,1,9,2005,5,20
4,48,9000000.00,1,0,5,15,33,12,69083.38,223007.51,...,21,81,2223,0,1971,3,7,2014,6,30

In [32]:
y

0       1
1       1
2       1
3       1
4       1
       ..
1244    0
1245    1
1246    1
1247    1
1248    1
Name: Status, Length: 1249, dtype: int64

In [33]:
from sklearn.model_selection import train_test_split

In [34]:
X_train,X_test,y_train,y_test = train_test_split(X,y,test_size=0.2,random_state=42)

In [35]:
X_train.shape

(999, 30)

In [36]:
X_test.shape

(250, 30)

In [37]:
from sklearn.ensemble import RandomForestClassifier

In [38]:
RFC = RandomForestClassifier()

In [39]:
RFC.fit(X_train,y_train)
y_pred = RFC.predict(X_test)

In [40]:
from sklearn.metrics import accuracy_score

In [41]:
accuracy_score(y_test,y_pred)

0.86

In [42]:
RFC.predict(np.array([49,7116.64,0,1,25,277,265,345,1459126.64,1230543.08,2068641.91,10,24,31,1516981.1,1764079.61,2378592.62,4758311.63,887,5659653.33,65,952,2231,2,1970,2,13,1994,6,30]).reshape(1,30))

C:\Users\lenovo\anaconda3\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but RandomForestClassifier was fitted with feature names
  warnings.warn(

array([1], dtype=int64)

In [43]:
from sklearn.ensemble import GradientBoostingClassifier
GBC = GradientBoostingClassifier()

In [44]:
GBC.fit(X_train,y_train)
y_pred = GBC.predict(X_test)

In [45]:
accuracy_score(y_test,y_pred)

0.864

In [46]:
from sklearn.svm import SVC
svc = SVC()
svc.fit(X_train,y_train)
y_pred = svc.predict(X_test)
accuracy_score(y_test,y_pred)

0.808

In [47]:
from sklearn.linear_model import LogisticRegression

In [48]:
LR = LogisticRegression()
LR.fit(X_train,y_train)
y_pred = LR.predict(X_test)
accuracy_score(y_test,y_pred)*100

C:\Users\lenovo\anaconda3\lib\site-packages\sklearn\linear_model\_logistic.py:814: ConvergenceWarning: lbfgs failed to converge (status=1):
STOP: TOTAL NO. of ITERATIONS REACHED LIMIT.

Increase the number of iterations (max_iter) or scale the data as shown in:
    https://scikit-learn.org/stable/modules/preprocessing.html
Please also refer to the documentation for alternative solver options:
    https://scikit-learn.org/stable/modules/linear_model.html#logistic-regression
  n_iter_i = _check_optimize_result(

81.2

In [49]:
from sklearn.ensemble import AdaBoostClassifier

In [50]:
ABC = AdaBoostClassifier()

In [51]:
ABC.fit(X_train,y_train)
y_pred = ABC.predict(X_test)
accuracy_score(y_test,y_pred)*100

87.2

In [52]:
ABC.predict(np.array([49,7116.64,0,1,25,277,265,345,1459126.64,1230543.08,2068641.91,10,24,31,1516981.1,1764079.61,2378592.62,4758311.63,887,5659653.33,65,952,2231,2,1970,2,13,1994,6,30]).reshape(1,30))

C:\Users\lenovo\anaconda3\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but AdaBoostClassifier was fitted with feature names
  warnings.warn(

array([1], dtype=int64)

In [53]:
#ABC.predict(np.array([ ]).reshape(1,30))

In [54]:
#re_df =  pd.read_excel('Recommed.xlsx')
#re_df.head()

In [55]:
#re_df.info()

In [56]:
#re_df['CUS_Gender'].replace({'MALE':0,'FEMALE':1},inplace=True)

In [57]:
#re_df['CUS_Marital_Status'].replace({'SINGLE':0,'MARRIED':1,'DIVORCE':2,'WIDOWED':3,'OTHER':4,'PARTNER':5},inplace=True)

In [58]:
#re_df['Status'].replace({'ACTIVE':1,'CHURN':0},inplace=True)

In [59]:
#re_df.info()

In [60]:
#df = pd.read_excel('CHURNDATA (1).xlsx')
#re_df =  pd.read_excel('Recommed.xlsx')

#merged_df =  pd.merge(df, re_df, on='AGE')

In [61]:
#re_df.head()

In [62]:
#re_df.info()

In [63]:
#merged_df.isnull().sum()

In [64]:
#pt = re_df.pivot_table(columns='YEARS_WITH_US',index='PRODUCTS',values='Status')

In [65]:
#pt.shape

In [66]:
#pt.fillna(0,inplace=True)

In [67]:
#from sklearn.metrics.pairwise import cosine_similarity

In [68]:
#similarity_scores = cosine_similarity(pt)

In [69]:
#similarity_scores.shape

In [70]:
import pickle
pickle.dump(ABC,open('nbamodel.pkl','wb'))